Revit 2024 API
AreaReinforcement.GetMovedLineTransform Method
 Returns a transform representing the movement of the line relative to its default position along the direction of the desired layer.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public Transform GetMovedLineTransform(
	AreaReinforcementLayerType layer,
	int linePositionIndex
)
Visual Basic
Public Function GetMovedLineTransform ( _
	layer As AreaReinforcementLayerType, _
	linePositionIndex As Integer _
) As Transform
Visual C++
public:
Transform^ GetMovedLineTransform(
	AreaReinforcementLayerType layer,
	int linePositionIndex
)
Parameters
layer
Type: Autodesk.Revit.DB.Structure.AreaReinforcementLayerType
 The layer on which the line stays.
linePositionIndex
Type: System.Int32
 The index of the line from the desired layer. It should be an index between 0 and (NumberOfLines-1).
Return Value
 The transform representing the movement of the line relative to its default position along the direction of the desired layer.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  linePositionIndex is not in the range [ 0, NumberOfLines-1 ]. -or- A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InapplicableDataException |  The layer layer isn't active.
Autodesk.Revit.Exceptions.InvalidOperationException |  This AreaReinforcement does not host Rebar.
See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace